Repository: lkaixian/invoice-uploader
Catalog: lib/l10n/intl_*.arb
Languages: ms

source: Select Language
ms: Pilih Bahasa

source: Language
ms: Bahasa

# appTitle
source: Finance and Invoice Manager App
ms: Apl Pengurus Kewangan dan Invois

source: Theme
ms: Tema

source: Switch Theme
ms: Tukar Tema

# themeLight
source: Light
ms: Cerah

# themeDark
source: Dark
ms: Gelap

# themeSystem
source: System Default
ms: Ikut Sistem

source: Settings
ms: Tetapan

# signedInMessage
source: ✅ Signed in as {email}
ms: ✅ Log masuk sebagai: {email}

source: ❌ Sign-in cancelled
ms: ❌ Log masuk dibatalkan

source: 🔒 Signed out
ms: 🔒 Telah log keluar

# signInError
source: ❌ Error signing in: {error}
ms: ❌ Ralat log masuk: {error}

# welcomeHeader
source: Welcome!
ms: Selamat Datang!

source: Welcome, {user}
ms: Selamat datang, {user}

# pleaseSignIn
source: Please sign in to begin.
ms: Sila log masuk untuk memulakan.

# signInButton
source: Sign In
ms: Log Masuk

# signOutButton
source: Sign Out
ms: Log Keluar

# receiptUpload
source: Single Upload
ms: Muat Naik Tunggal

source: Spreadsheet
ms: Lembaran Kerja

# noCategory
source: ⚠️ No category chosen yet. Please upload at least one receipt first.
ms: ⚠️ Tiada kategori dipilih. Sila muat naik sekurang-kurangnya satu resit dahulu.

# spreadsheetOpenFail
source: ❌ Failed to open spreadsheet: {error}
ms: ❌ Gagal buka lembaran: {error}

source: ✅ Upload success!
ms: ✅ Berjaya dimuat naik!

# uploadFailed
source: ❌ Upload failed: {statusCode} {error}
ms: ❌ Gagal muat naik: {statusCode} {error}

# incompleteData
source: ❌ Some data is incomplete. Please check your entries.
ms: ❌ Maklumat tidak lengkap. Sila semak input anda.

source: No image selected
ms: Tiada imej dipilih

# cameraButton
source: Camera
ms: Kamera

# galleryButton
source: Gallery
ms: Galeri

# categoryLabel
source: Category
ms: Kategori

source: Select Category
ms: Pilih Kategori

# addCategoryOption
source: ➕ Add Category
ms: ➕ Tambah Kategori

# newCategoryLabel
source: New Category Name
ms: Nama Kategori Baru

# deleteCategoryTitle
source: Delete '{category}'?
ms: Padam “{category}”?

# deleteCategoryTitlePlaceholder
source: Delete selected category
ms: Padam kategori yang dipilih

# deleteCategoryConfirm
source: Do you want to remove this category?
ms: Adakah anda pasti ingin memadam kategori ini?

source: Delete
ms: Padam

source: Cancel
ms: Batal

# amountLabel
source: Invoice Amount (e.g. 34.50)
ms: Jumlah Resit (cth: 34.50)

source: Enter Amount
ms: Masukkan Jumlah

# filenameLabel
source: Filename (optional: auto generated)
ms: Nama Fail (pilihan: auto jana)

source: Select Files
ms: Pilih Fail

source: Date
ms: Tarikh

source: File
ms: Fail

source: Previous
ms: Sebelumnya

source: Next
ms: Seterusnya

source: Pick Date
ms: Pilih Tarikh

source: No date selected
ms: Tiada tarikh dipilih

# uploadButton
source: Upload!
ms: Muat Naik!

source: Uploading, please wait...
ms: Sila tunggu, sedang memuat naik...

# uploadProgress
source: Uploading and updating sheet...
ms: Memuat naik dan mengemas kini lembaran...

# uploadSuccessSnackbar
source: ✅ Uploaded & logged to sheet!
ms: ✅ Berjaya dimuat naik & direkod!

# uploadFailedSnackbar
source: ❌ Upload failed
ms: ❌ Muat naik gagal

# uploadErrorTitle
source: Upload Error
ms: Ralat Muat Naik

source: View Expenses
ms: Lihat Perbelanjaan

source: View All
ms: Lihat Semua

source: Bulk Upload
ms: Muat Naik Pukal

# uploadedCount
source: Uploaded {uploaded} of {total}
ms: Dimuat naik {uploaded} / {total}

source: Add more files
ms: Tambah Lagi Fail

source: Original name
ms: Nama Asal

source: Auto-generate filename
ms: Auto Jana Nama Fail

# topCategories
source: Top 3 Categories
ms: 3 Kategori Tertinggi

# topSpends
source: Top 3 Spends
ms: 3 Perbelanjaan Tertinggi

# monthJanuary
source: January
ms: Januari

# monthFebruary
source: February
ms: Februari

# monthMarch
source: March
ms: Mac

# monthMay
source: May
ms: Mei

# monthJune
source: June
ms: Jun

# monthJuly
source: July
ms: Julai

# monthAugust
source: August
ms: Ogos

# monthOctober
source: October
ms: Oktober

# monthDecember
source: December
ms: Disember

# buyMeCoffee
source: Buy me a coffee ☕
ms: Belanja Saya Kopi ☕

# supportMyWork
source: CAWFEE TIME! If you find this app useful, consider buying me a coffee to support my work.
ms: Jika anda rasa aplikasi ini membantu, pertimbangkan untuk belanja saya kopi sebagai tanda sokongan.

# linkOpenFailed
source: Could not open the link
ms: Gagal buka pautan

source: Use custom file name
ms: Guna Nama Fail Tersuai

source: File Name
ms: Nama Fail

# fileNameHint
source: e.g. InvoiceLog
ms: Contoh: InvoiceLog

source: About
ms: Tentang

# aboutDescription
source: A simple app to manage your finance and invoices using Flutter and Google APIs. It allows you to upload receipts, log expenses, and view your financial data in a structured way. Built with love by Larm Kai Xian.
ms: Ini adalah aplikasi untuk memuat naik dan merekod resit. Ia menyokong pengecaman imej, muat naik Google Drive dan penyelarasan Google Sheets.

# aboutDisclaimer
source: Credits: - Flutter & Dart SDK - Google APIs (Drive, Sheets, Sign-In) - flutter_dotenv for secure environment config - firebase_crashlytics
ms: Penghargaan: - Flutter & Dart SDK - Google APIs (Drive, Sheets, Sign-In) - flutter_dotenv untuk konfigurasi .env - firebase_crashlytics - dan pustaka sumber terbuka lain

# aboutVersion
source: Version
ms: Versi

# reportIssue
source: Report an Issue
ms: Laporkan Isu

# reportIssueSubtitle
source: Found a bug? Let us know on GitHub.
ms: Jumpa pepijat? Maklumkan kami di GitHub.

source: Permanent Auto File Name
ms: Nama Fail Auto Kekal

# permanentAutoFileNameSubtitle
source: Always auto-generate filenames without editing
ms: Sentiasa jana nama fail secara automatik tanpa suntingan

source: Permanent auto filename enabled
ms: Auto nama fail kekal diaktifkan

source: Permanent auto filename disabled
ms: Auto nama fail kekal dinyahaktifkan

# changelogTitle
source: What's New
ms: Apa Yang Baharu

# changelog_1
source: Added Traditional Chinese language support
ms: Ditambah sokongan bahasa Cina Tradisional

# changelog_2
source: Added About section
ms: Ditambah seksyen Mengenai

# changelog_3
source: Added option for permanent auto filename generation (in settings)
ms: Ditambah pilihan untuk penjanaan nama fail automatik secara kekal (dalam tetapan)

# changelog_4
source: Added Firebase Crashlytics for crash reporting
ms: Ditambah Firebase Crashlytics untuk laporan ranap

# changelog_5
source: Added 'Report a bug' button that redirects to GitHub Issues (in settings)
ms: Ditambah butang 'Lapor pepijat' yang terus ke tab Isu GitHub (dalam tetapan)

# changelog_6
source: Added web support — access the app via website
ms: Ditambah ciri web — boleh lawat aplikasi melalui laman web

# changelog_7
source: Replaced print() with logging system
ms: Ciri log menggantikan fungsi print()

# changelog_8
source: Minor bug fixes
ms: Penambahbaikan dan pembaikan pepijat kecil

# changelog_note
source: Note: Versioning format changed to <1.0.0 for pre-releases. Build number format: YYYYMMW-BUILD_TYPE, where BUILD_TYPE = RELEASE, BETA, NIGHTLY
ms: Nota: Versi ditetapkan sebagai <1.0.0 untuk versi pra-lepas. Nombor binaan menggunakan format YYYYMMW-BUILD_TYPE, di mana BUILD_TYPE = RELEASE, BETA, NIGHTLY

# changelog_latest_1
source: Added "What's new section".
ms: Ditambah bahagian "Apa Yang Baharu".

# changelog_latest_2
source: App name changed to suit current featureset.
ms: Nama aplikasi ditukar mengikut fungsi semasa.

# changelog_latest_3
source: Naming changed from "Receipt Upload" to "Single Upload".
ms: Nama "Muat Naik Resit" ditukar kepada "Muat Naik Tunggal".

# changelog_latest_4
source: Redesigned Category selection and synchronous across both uploads.
ms: Pemilihan kategori direka semula dan kini disegerakkan pada kedua-dua jenis muat naik.

# changelog_latest_5
source: Overhaul bulk uploading process to be more intuitive.
ms: Proses muat naik pukal dirombak agar lebih intuitif.

# changelog_latest_6
source: Users can now change, add, and remove categories during bulk uploading.
ms: Pengguna kini boleh menukar, menambah dan memadam kategori semasa muat naik pukal.

# changelog_latest_7
source: Fixed colors and fonts for better intuitiveness.
ms: Membaiki warna dan fon agar lebih mesra pengguna.

# changelog_latest_8
source: Implementing notification pop out for prototyping.
ms: Melaksanakan pop notifikasi untuk prototaip.

# changelog_latest_9
source: Implementing queued uploads.
ms: Melaksanakan muat naik berbaris.

# changelog_latest_note
source: Note: WIP, disabled.
ms: Nota: Masih dalam pembangunan, belum diaktifkan.
